#### Bibliotecas para Data Science

Pandas, Numpy e Scikit-Learn

In [2]:
# carregando um arquivo de dados com Pandas

In [3]:
import pandas as pd

In [4]:
dataframe = pd.read_csv('../dados/tempo_salarios.csv')
dataframe.head()

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [5]:
# criando objetos Series

In [6]:
print('criando uma instância de Series a partir de uma\
 lista numérica:')

copa_do_mundo = pd.Series([1952, 1962, 1970, 1994, 2002])

print('anos em que o Brasil foi campeão mundial de futebol:')
print(f'{copa_do_mundo}')

criando uma instância de Series a partir de uma lista numérica:
anos em que o Brasil foi campeão mundial de futebol:
0    1952
1    1962
2    1970
3    1994
4    2002
dtype: int64

In [7]:
s = pd.Series((1, 2, 3))
print(f'\ncriando uma série a partir de uma tupla:')
print(s)
print(f'tipo de variável: {type(s)}')

criando uma série a partir de uma tupla:
0    1
1    2
2    3
dtype: int64
tipo de variável: <class 'pandas.core.series.Series'>

In [8]:
s = pd.Series({'a': 1, 'b': 2, 'c': 3})
print('\ncriando uma série a partir de um dicionário:')
print(s)
print(f'tipo da variável: {type(s)}')

criando uma série a partir de um dicionário:
a    1
b    2
c    3
dtype: int64
tipo da variável: <class 'pandas.core.series.Series'>

In [9]:
s = pd.Series(['Wes McKinney', 'Criador da Pandas'], 
              index = ['Pessoa', 'Quem'])

print(f'\ncriando uma série a partir de uma lista de \
 valores e outra de rótulos:')

print(s)
print(f'tipo da variável: {type(s)}')

criando uma série a partir de uma lista de  valores e outra de rótulos:
Pessoa         Wes McKinney
Quem      Criador da Pandas
dtype: object
tipo da variável: <class 'pandas.core.series.Series'>

In [10]:
# exibindo o cabeçalho e o rodapé do seu dataset

In [11]:
dataframe.head()

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [12]:
dataframe.tail()

    AnosdeExperiencia   Salario
25                9.0  105582.0
26                9.5       NaN
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [13]:
dataframe.head(15)

    AnosdeExperiencia  Salario
0                 1.1  39343.0
1                 1.3  46205.0
2                 1.5  37731.0
3                 2.0  43525.0
4                 2.2  39891.0
5                 2.9  56642.0
6                 NaN  60150.0
7                 3.2  54445.0
8                 3.2  64445.0
9                 3.7  57189.0
10                3.9  63218.0
11                4.0  55794.0
12                4.0  56957.0
13                4.1  57081.0
14                4.5      NaN

In [14]:
# conferindo a quantidade de entradas no dataset

In [15]:
print(len(dataframe))

30

In [16]:
# examinando tipos de dados

In [17]:
dataframe.dtypes

AnosdeExperiencia    float64
Salario              float64
dtype: object

In [18]:
dataframe.describe()

       AnosdeExperiencia        Salario
count          29.000000      27.000000
mean            5.393103   74454.518519
std             2.853686   27444.112683
min             1.100000   37731.000000
25%             3.200000   56218.000000
50%             4.900000   64445.000000
75%             7.900000   99787.500000
max            10.500000  122391.000000

In [19]:
dataframe['AnosdeExperiencia'].head()

0    1.1
1    1.3
2    1.5
3    2.0
4    2.2
Name: AnosdeExperiencia, dtype: float64

In [20]:
dataframe.Salario[5:10] # uma fatia da coluna salário do dataframe

5    56642.0
6    60150.0
7    54445.0
8    64445.0
9    57189.0
Name: Salario, dtype: float64

In [21]:
dataframe.Salario[5:10].values

array([56642., 60150., 54445., 64445., 57189.])

In [22]:
dataframe[0:5]

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [23]:
dataframe[20:30]

    AnosdeExperiencia   Salario
20                6.8       NaN
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5       NaN
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [24]:
dataframe[:-25]

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [25]:
dataframe[-10:]

    AnosdeExperiencia   Salario
20                6.8       NaN
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5       NaN
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [26]:
# as funções iloc() e loc()

In [27]:
dataframe[3] # erro

KeyError: 3

In [ ]:
dataframe.loc[3]

AnosdeExperiencia        2.0
Salario              43525.0
Name: 3, dtype: float64

In [ ]:
dataframe.loc[dataframe.Salario > 80_000] # filtro para salários superiores à 80.000

    AnosdeExperiencia   Salario
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8   91738.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5  116969.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [ ]:
# .iloc[linhas, colunas]
dataframe.iloc[0:30, 0:1] # mesmo que dataframe.iloc[:,0:1]

    AnosdeExperiencia
0                 1.1
1                 1.3
2                 1.5
3                 2.0
4                 2.2
5                 2.9
6                 3.0
7                 3.2
8                 3.2
9                 3.7
10                3.9
11                4.0
12                4.0
13                4.1
14                4.5
15                4.9
16                5.1
17                5.3
18                5.9
19                6.0
20                6.8
21                7.1
22                7.9
23                8.2
24                8.7
25                9.0
26                9.5
27                9.6
28               10.3
29               10.5

In [ ]:
dataframe.iloc[0:30, 0:1].values

array([[ 1.1],
       [ 1.3],
       [ 1.5],
       [ 2. ],
       [ 2.2],
       [ 2.9],
       [ 3. ],
       [ 3.2],
       [ 3.2],
       [ 3.7],
       [ 3.9],
       [ 4. ],
       [ 4. ],
       [ 4.1],
       [ 4.5],
       [ 4.9],
       [ 5.1],
       [ 5.3],
       [ 5.9],
       [ 6. ],
       [ 6.8],
       [ 7.1],
       [ 7.9],
       [ 8.2],
       [ 8.7],
       [ 9. ],
       [ 9.5],
       [ 9.6],
       [10.3],
       [10.5]])

In [ ]:
transportes = pd.read_csv('../dados/transportes.csv')
transportes

           Tipo  Velocidade   Peso  Consumo  Autonomia      Valor
0   Motocicleta         120    116     41.0        656      25000
1     Automovel         140   2000     15.0        800      55000
2   Helicoptero         280    450      5.0       1262    7000000
3         Aviao         900  28000      0.3      12000  112000000
4  Motoplanador         200    322     18.0       1200     150000
5     Bicicleta          30     11      0.0        100        700

In [ ]:
transportes.loc['Motocicleta'] # erro

In [ ]:
transportes = pd.read_csv('../dados/transportes.csv', index_col=0)
transportes

              Velocidade   Peso  Consumo  Autonomia      Valor
Tipo
Motocicleta          120    116     41.0        656      25000
Automovel            140   2000     15.0        800      55000
Helicoptero          280    450      5.0       1262    7000000
Aviao                900  28000      0.3      12000  112000000
Motoplanador         200    322     18.0       1200     150000
Bicicleta             30     11      0.0        100        700

In [ ]:
transportes.loc['Motocicleta']

Velocidade      120.0
Peso            116.0
Consumo          41.0
Autonomia       656.0
Valor         25000.0
Name: Motocicleta, dtype: float64

In [ ]:
# limpeza de valores ausentes

In [ ]:
salario_incompleto = pd.read_csv('../dados/tempo_salarios.csv')
salario_incompleto

    AnosdeExperiencia   Salario
0                 1.1   39343.0
1                 1.3   46205.0
2                 1.5   37731.0
3                 2.0   43525.0
4                 2.2   39891.0
5                 2.9   56642.0
6                 NaN   60150.0
7                 3.2   54445.0
8                 3.2   64445.0
9                 3.7   57189.0
10                3.9   63218.0
11                4.0   55794.0
12                4.0   56957.0
13                4.1   57081.0
14                4.5       NaN
15                4.9   67938.0
16                5.1   66029.0
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8       NaN
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5       NaN
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [ ]:
salario_incompleto.isna()

    AnosdeExperiencia  Salario
0               False    False
1               False    False
2               False    False
3               False    False
4               False    False
5               False    False
6                True    False
7               False    False
8               False    False
9               False    False
10              False    False
11              False    False
12              False    False
13              False    False
14              False     True
15              False    False
16              False    False
17              False    False
18              False    False
19              False    False
20              False     True
21              False    False
22              False    False
23              False    False
24              False    False
25              False    False
26              False     True
27              False    False
28              False    False
29              False    False

In [ ]:
'''
mesmo sem tratamento, os valores ausentes são calculados normalmente,
impactando as medidas estatísticas.
'''

'\nmesmo sem tratamento, os valores ausentes são calculados normalmente,\nimpactando as medidas estatísticas.\n'

In [ ]:
salario_incompleto.describe()

       AnosdeExperiencia        Salario
count          29.000000      27.000000
mean            5.393103   74454.518519
std             2.853686   27444.112683
min             1.100000   37731.000000
25%             3.200000   56218.000000
50%             4.900000   64445.000000
75%             7.900000   99787.500000
max            10.500000  122391.000000

In [ ]:
dataframe.describe()

       AnosdeExperiencia        Salario
count          30.000000      30.000000
mean            5.313333   76003.000000
std             2.837888   27414.429785
min             1.100000   37731.000000
25%             3.200000   56720.750000
50%             4.700000   65237.000000
75%             7.700000  100544.750000
max            10.500000  122391.000000

In [ ]:
'''
uma estratégia que pode ser utilizada é substituir os valores ausentes por 0 (zero).
Não é uma prática comum pois altera consideravelmente a média e o desvio padrão
'''

'\numa estratégia que pode ser utilizada é substituir os valores ausentes por 0 (zero).\nNão é uma prática comum pois altera consideravelmente a média e o desvio padrão\n'

In [ ]:
salario_incompleto

    AnosdeExperiencia   Salario
0                 1.1   39343.0
1                 1.3   46205.0
2                 1.5   37731.0
3                 2.0   43525.0
4                 2.2   39891.0
5                 2.9   56642.0
6                 NaN   60150.0
7                 3.2   54445.0
8                 3.2   64445.0
9                 3.7   57189.0
10                3.9   63218.0
11                4.0   55794.0
12                4.0   56957.0
13                4.1   57081.0
14                4.5       NaN
15                4.9   67938.0
16                5.1   66029.0
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8       NaN
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5       NaN
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [ ]:
salario_incompleto.fillna(0)

    AnosdeExperiencia   Salario
0                 1.1   39343.0
1                 1.3   46205.0
2                 1.5   37731.0
3                 2.0   43525.0
4                 2.2   39891.0
5                 2.9   56642.0
6                 0.0   60150.0
7                 3.2   54445.0
8                 3.2   64445.0
9                 3.7   57189.0
10                3.9   63218.0
11                4.0   55794.0
12                4.0   56957.0
13                4.1   57081.0
14                4.5       0.0
15                4.9   67938.0
16                5.1   66029.0
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8       0.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5       0.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [ ]:
salario_tratado = salario_incompleto.fillna(0)
salario_tratado

    AnosdeExperiencia   Salario
0                 1.1   39343.0
1                 1.3   46205.0
2                 1.5   37731.0
3                 2.0   43525.0
4                 2.2   39891.0
5                 2.9   56642.0
6                 0.0   60150.0
7                 3.2   54445.0
8                 3.2   64445.0
9                 3.7   57189.0
10                3.9   63218.0
11                4.0   55794.0
12                4.0   56957.0
13                4.1   57081.0
14                4.5       0.0
15                4.9   67938.0
16                5.1   66029.0
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8       0.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5       0.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [ ]:
# utilando a mediana 
salario_tratado = salario_incompleto.fillna(salario_incompleto.median())
salario_tratado

    AnosdeExperiencia   Salario
0                 1.1   39343.0
1                 1.3   46205.0
2                 1.5   37731.0
3                 2.0   43525.0
4                 2.2   39891.0
5                 2.9   56642.0
6                 4.9   60150.0
7                 3.2   54445.0
8                 3.2   64445.0
9                 3.7   57189.0
10                3.9   63218.0
11                4.0   55794.0
12                4.0   56957.0
13                4.1   57081.0
14                4.5   64445.0
15                4.9   67938.0
16                5.1   66029.0
17                5.3   83088.0
18                5.9   81363.0
19                6.0   93940.0
20                6.8   64445.0
21                7.1   98273.0
22                7.9  101302.0
23                8.2  113812.0
24                8.7  109431.0
25                9.0  105582.0
26                9.5   64445.0
27                9.6  112635.0
28               10.3  122391.0
29               10.5  121872.0

In [ ]:
# como ficou a estatística descritiva dos dados
salario_tratado.describe()

       AnosdeExperiencia        Salario
count          30.000000      30.000000
mean            5.376667   73453.566667
std             2.805497   26164.714716
min             1.100000   37731.000000
25%             3.325000   56720.750000
50%             4.900000   64445.000000
75%             7.700000   97189.750000
max            10.500000  122391.000000

In [ ]:
'''
uma estratégia é utilizar interpolação de valores. A interpolação faz
a consideração prévia de que, provavelmente, o valor omitido na amostra
está próximo dos valores anterior e posterior. Essa funcionalidade calcula
uma aproximação linear dos dois valores e substitui o valor ausente pelo 
resultado. É bastante útil em projetos em que se deseja encontrar um modelo
linear que represente os dados.
'''

'\numa estratégia é utilizar interpolação de valores. A interpolação faz\na consideração prévia de que, provavelmente, o valor omitido na amostra\nestá próximo dos valores anterior e posterior. Essa funcionalidade calcula\numa aproximação linear dos dois valores e substitui o valor ausente pelo \nresultado. É bastante útil em projetos em que se deseja encontrar um modelo\nlinear que represente os dados.\n'

In [ ]:
salario_tratado = salario_incompleto.fillna(salario_incompleto.interpolate())
salario_tratado

    AnosdeExperiencia   Salario
0                1.10   39343.0
1                1.30   46205.0
2                1.50   37731.0
3                2.00   43525.0
4                2.20   39891.0
5                2.90   56642.0
6                3.05   60150.0
7                3.20   54445.0
8                3.20   64445.0
9                3.70   57189.0
10               3.90   63218.0
11               4.00   55794.0
12               4.00   56957.0
13               4.10   57081.0
14               4.50   62509.5
15               4.90   67938.0
16               5.10   66029.0
17               5.30   83088.0
18               5.90   81363.0
19               6.00   93940.0
20               6.80   96106.5
21               7.10   98273.0
22               7.90  101302.0
23               8.20  113812.0
24               8.70  109431.0
25               9.00  105582.0
26               9.50  109108.5
27               9.60  112635.0
28              10.30  122391.0
29              10.50  121872.0

In [ ]:
# pivotamento

In [ ]:
dataframe = pd.DataFrame(
    {
        'Nome': ['Alice', 'Alice', 'Alice', 'Roberto', 'Roberto', 'Roberto'],
        'Idade': ['19', '22', '32', '19', '22', '32'],
        'Identificação': [1, 2, 3, 4, 5, 6],
        'Cursos': ['Direito', 'Administração', 'Matemática', 'Arquitetura', 'Design',
                   'Engenharia']
    }
)

In [ ]:
dataframe

      Nome Idade  Identificação         Cursos
0    Alice    19              1        Direito
1    Alice    22              2  Administração
2    Alice    32              3     Matemática
3  Roberto    19              4    Arquitetura
4  Roberto    22              5         Design
5  Roberto    32              6     Engenharia

In [ ]:
dataframe.pivot(index='Nome', columns='Idade', values='Identificação')

Idade    19  22  32
Nome
Alice     1   2   3
Roberto   4   5   6

In [ ]:
dataframe.pivot(index='Cursos', columns='Nome', values=['Identificação',
                                                        'Idade'])

              Identificação         Idade
Nome                  Alice Roberto Alice Roberto
Cursos
Administração             2     NaN    22     NaN
Arquitetura             NaN       4   NaN      19
Design                  NaN       5   NaN      22
Direito                   1     NaN    19     NaN
Engenharia              NaN       6   NaN      32
Matemática                3     NaN    32     NaN

In [ ]:
# localizando valores nulos

In [30]:
dataframe.isnull()

    AnosdeExperiencia  Salario
0               False    False
1               False    False
2               False    False
3               False    False
4               False    False
5               False    False
6                True    False
7               False    False
8               False    False
9               False    False
10              False    False
11              False    False
12              False    False
13              False    False
14              False     True
15              False    False
16              False    False
17              False    False
18              False    False
19              False    False
20              False     True
21              False    False
22              False    False
23              False    False
24              False    False
25              False    False
26              False     True
27              False    False
28              False    False
29              False    False

In [34]:
# uma forma rápida de determinar se há valores nulos
print(dataframe.Salario.isnull().values.any())
print(dataframe.AnosdeExperiencia.isnull().values.any())

True
True

In [35]:
# excluindo informações

In [36]:
# remover valores de um dataframe
df = pd.read_csv('../dados/transportes.csv')
print('antes da alteração:')
print(df)

antes da alteração:
           Tipo  Velocidade   Peso  Consumo  Autonomia      Valor
0   Motocicleta         120    116     41.0        656      25000
1     Automovel         140   2000     15.0        800      55000
2   Helicoptero         280    450      5.0       1262    7000000
3         Aviao         900  28000      0.3      12000  112000000
4  Motoplanador         200    322     18.0       1200     150000
5     Bicicleta          30     11      0.0        100        700

In [37]:
print('excluindo as linhas 3 e 5:')
df = df.drop([3, 5])
print(df)

excluindo as linhas 3 e 5:
           Tipo  Velocidade  Peso  Consumo  Autonomia    Valor
0   Motocicleta         120   116     41.0        656    25000
1     Automovel         140  2000     15.0        800    55000
2   Helicoptero         280   450      5.0       1262  7000000
4  Motoplanador         200   322     18.0       1200   150000

In [38]:
print('excluindo a coluna autonomia:')
df = df.drop('Autonomia', axis=1)
print(df)

excluindo a coluna autonomia:
           Tipo  Velocidade  Peso  Consumo    Valor
0   Motocicleta         120   116     41.0    25000
1     Automovel         140  2000     15.0    55000
2   Helicoptero         280   450      5.0  7000000
4  Motoplanador         200   322     18.0   150000

In [39]:
print('excluindo duas colunas pelo nome:')
df = df.drop(['Peso', 'Consumo'], axis=1)
print(df)

excluindo duas colunas pelo nome:
           Tipo  Velocidade    Valor
0   Motocicleta         120    25000
1     Automovel         140    55000
2   Helicoptero         280  7000000
4  Motoplanador         200   150000

In [ ]:
# excluindo um conjunto de linhas do dataset com alguma característica em particular
# ex.: se descobrissemos que havia no nosso dataframe registros de problemas de migração como autonomia e 
# peso zerados

# excluir_autonomia_zero = df.index[df.Autonomia==0].tolist()
# excluir_peso_zero = df.index[df.Peso==0].tolist()
# temp = excluir_autonomia_zero + excluir_peso_zero
# df = df.drop(df.index(temp))

In [40]:
# aplicando uma expressão lambda a um dataframe

In [41]:
# apply(função) - Aplica a função passada como parâmetro  a uma dada coluna ou linha do dataframe.
# applymap(função) - faz o mesmo que o apply(), porém, atuando em cada elemento da estrutura.

In [42]:
import numpy as np

In [43]:
cubo = lambda x: x**3
formato_decimal = lambda x: '%.1f' % x

In [47]:
# criando um dataframe
matriz_4x4 = np.array([
    [1, 2, 3, 4],
    [2, 4, 6, 8],
    [3, 8, 12, 16],
    [4, 16, 24, 32]
])

df = pd.DataFrame(matriz_4x4)
print(f'dataframe original: \n {df} \n')

df_cubo = df.apply(cubo)
print(f'elevando os elementos ao cubo: \n {df_cubo} \n')

df_cubo = df_cubo.applymap(formato_decimal)
print(f'formatando para uma casa decimal: \n {df_cubo}')

dataframe original:
    0   1   2   3
0  1   2   3   4
1  2   4   6   8
2  3   8  12  16
3  4  16  24  32

elevando os elementos ao cubo:
     0     1      2      3
0   1     8     27     64
1   8    64    216    512
2  27   512   1728   4096
3  64  4096  13824  32768

formatando para uma casa decimal:
       0       1        2        3
0   1.0     8.0     27.0     64.0
1   8.0    64.0    216.0    512.0
2  27.0   512.0   1728.0   4096.0
3  64.0  4096.0  13824.0  32768.0

C:\Users\jonat\AppData\Local\Temp\ipykernel_11116\2737506304.py:15: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_cubo = df_cubo.applymap(formato_decimal)

In [48]:
'''
para aplicar uma expressão lambda a uma coluna ou linha de um dataframe, use o método
apply(); para fazê-lo sobre cada elemento da coleção, iterando item a item, use applymap().
'''

'\npara aplicar uma expressão lambda a uma coluna ou linha de um dataframe, use o método\napply(); para fazê-lo sobre cada elemento da coleção, iterando item a item, use applymap().\n'

In [49]:
# somando valores de um atributo de um dataframe

In [54]:
print(f'total de salários: R$ {dataframe['Salario'].sum():.2f}.')

total de salários: R$ 2010272.00.

In [55]:
# contando valores não nulos de um atributo de um dataframe

In [56]:
# usando count para contar quantos estão empregados em um df hipotético

# print(f'há {(df['Empregado'] == 1).count()} pessoas empregadas na base de \
# dados')
# print(f'e {(df.Empregado == 0).count() desempregados}')

In [57]:
# criando gráficos estatísticos com Pandas